# Отчет по лабораторной работе № 8
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Григорьев Тимофей Андреевич

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Системы программирования на языке Си
2. **Цель работы**: изучение конкретной системы программирования на Си и получение навыков подготовки текстов и отладки программ.
3. **Задание**:
- изучить и освоить возможности лабораторной СП по содержащейся в практикуме документации и другим источникам, в том числе основные этапы процесса компиляции и подготовки программ к выполнению
- составить и отладить простейшую программу на Си в терминальном классе
- изучить различные системы программирования на Си на других платформах: GNU, MS Visual Studio и др. на домашних компьютерах.
4. **Идея, метод, алгоритм решения задачи**: 
*   Для выполнения работы необходимо ознакомиться с документацией конкретной системы программирования на языке C, в данном случае — лабораторной системой программирования (СП).
*   Освоить основные этапы процесса компиляции и подготовки программы к выполнению.
*   Составить и отладить простейшую программу на языке C в терминальном классе.
*   Изучить различные системы программирования на языке C на других платформах, таких как GNU, MS Visual Studio и др., на домашних компьютерах.
5. **Сценарий выполнения работы**:
*   Открыть файл `lab8.c` в редакторе кода.
*   Написать программу на языке C, выводящую сообщение "Hello, stranger!".
*   Сохранить изменения и закрыть редактор кода.
*   Компилировать программу с использованием компилятора GCC: `gcc -std=c99 -Wall -pedantic lab8.c`.
*   Проверить наличие созданного исполняемого файла `a.out`.
*   Запустить программу: `./a.out`.
*   Зафиксировать успешное выполнение программы.

6. **Протокол**: 
```c
timofey@lpc:~/code/inf_labs/8$ code report.md
timofey@lpc:~/code/inf_labs/8$ ls
report.md
timofey@lpc:~/code/inf_labs/8$ vim lab8.c
timofey@lpc:~/code/inf_labs/8$ ls
lab8.c  report.md
timofey@lpc:~/code/inf_labs/8$ cat lab8.c 
/* Лабораторная работа 8, 
 * Студент М8О-108Б-23 Т. Григорьев */

#include <stdio.h>

int main() {
	printf("Hello, stranger!\n")
	return 0;
}
timofey@lpc:~/code/inf_labs/8$ gcc -std=c99 -Wall -pedantic lab8.c
lab8.c: In function ‘main’:
lab8.c:7:37: error: expected ‘;’ before ‘return’
    7 |         printf("Hello, stranger!\n")
      |                                     ^
      |                                     ;
    8 |         return 0;
      |         ~~~~~~                       
timofey@lpc:~/code/inf_labs/8$ vim lab8.c
timofey@lpc:~/code/inf_labs/8$ gcc -std=c99 -Wall -pedantic lab8.c
timofey@lpc:~/code/inf_labs/8$ ls
a.out  lab8.c  report.md
timofey@lpc:~/code/inf_labs/8$ ./a.out
Hello, stranger!
timofey@lpc:~/code/inf_labs/8$ 
```
7. **Замечания автора** -
8. **Выводы**: 
    В ходе выполнения лабораторной работы были освоены основы работы с конкретной системой программирования на языке C. Написанная простейшая программа успешно скомпилирована и выполнена. Процесс отладки позволил исправить ошибку в коде и получить корректный результат.
    Работа с различными системами программирования на языке C на домашних компьютерах дала представление о том, как адаптировать программы под разные платформы и компиляторы.

    Полученные знания о процессе компиляции и отладки программ на языке C будут полезны при разработке программного обеспечения в будущем. Важным опытом было также взаимодействие с терминалом и редактором кода, что способствует формированию навыков работы в командной строке.

    В целом, лабораторная работа позволила углубить знания по языку C и приобрести практические навыки, которые могут быть применены в реальных проектах разработки программного обеспечения.